gt/lectureplan2015.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Lecture Plan "Game Theory" 2015</title>
<!-- 2015-08-08 Sat 17:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Christoph Schottmueller" />
</head>
<body>
<div id="content">
<h1 class="title">Lecture Plan "Game Theory" 2015</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Lecture 1: Intro expected utility theorem</a></li>
<li><a href="#sec-2">Lecture 2: Strategic games and equilibrium</a></li>
<li><a href="#sec-3">Lecture 3: NE</a></li>
<li><a href="#sec-4">Lecture 4: Rationalizability and dominance</a></li>
<li><a href="#sec-5">Lecture 5: Correlated equilibrium</a></li>
<li><a href="#sec-6">Lecture 6: Supermodular games</a></li>
<li><a href="#sec-7">Lecture 7: Refinements in strategic form games</a></li>
<li><a href="#sec-8">Lecture 8: Refinements in extensive form games with imperfect information</a></li>
<li><a href="#sec-9">Lecture 9: Midterm Assignment</a></li>
<li><a href="#sec-10">Lecture 10: Knowledge I</a></li>
<li><a href="#sec-11">Lecture 11: Knowledge II</a></li>
<li><a href="#sec-12">Lecture 12: Global Games</a></li>
<li><a href="#sec-13">Lecture 13: Social Choice I</a></li>
<li><a href="#sec-14">Lecture 14: Social Choice II</a></li>
<li><a href="#sec-15">Bibliography</a></li>
</ul>
</div>
</div>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Lecture 1: Intro expected utility theorem</h2>
<div class="outline-text-2" id="text-1">
</div><ul class="org-ul"><li><a id="sec-1-1" name="sec-1-1"></a>Introduction<br  /></li>
<li><a id="sec-1-2" name="sec-1-2"></a>What is GT?<br  /></li>
<li><a id="sec-1-3" name="sec-1-3"></a>expected utility theorem<br  /></li>
<li><a id="sec-1-4" name="sec-1-4"></a>reading:  MSZ 2.1-2.5 or MWG 6.A-6.B, (supplementary reading: Aumann 1985)<br  /><div class="outline-text-3" id="text-1-4">
</div>
</li></ul>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Lecture 2: Strategic games and equilibrium</h2>
<div class="outline-text-2" id="text-2">
</div><ul class="org-ul"><li><a id="sec-2-1" name="sec-2-1"></a>Strategic games<br  /></li>
<li><a id="sec-2-2" name="sec-2-2"></a>Nash equilibrium<br  /><div class="outline-text-3" id="text-2-2">
</div>
</li>
<li><a id="sec-2-3" name="sec-2-3"></a>Mixed strategies<br  /><div class="outline-text-3" id="text-2-3">
</div>
</li>
<li><a id="sec-2-4" name="sec-2-4"></a>reading:  OR 2.1-2.3, 3.1-3.2 or MSZ 4.1,4.3,4.4,4.8,4.9, 5.1-5.2<br  /><div class="outline-text-3" id="text-2-4">
</div>
</li></ul>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Lecture 3: NE</h2>
<div class="outline-text-2" id="text-3">
</div><ul class="org-ul"><li><a id="sec-3-1" name="sec-3-1"></a>Fixed point theorems<br  /></li>
<li><a id="sec-3-2" name="sec-3-2"></a>Nash existence theorem<br  /></li>
<li><a id="sec-3-3" name="sec-3-3"></a>reading: MSZ 5.3, (supplementary reading: OR 2.4; a proof of Brouwer's fixed point theorem can be found in MSZ 23.1 but reading this proof is by no means necessary)<br  /><div class="outline-text-3" id="text-3-3">
</div>
</li></ul>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Lecture 4: Rationalizability and dominance</h2>
<div class="outline-text-2" id="text-4">
</div><ul class="org-ul"><li><a id="sec-4-1" name="sec-4-1"></a>Rationalizability and iterated elimination of dominated strategies<br  /></li>
<li><a id="sec-4-2" name="sec-4-2"></a>(Global game example)<br  /></li>
<li><a id="sec-4-3" name="sec-4-3"></a>reading: OR 4 or MSZ 4.5, 4.7, 4.11,<br  /><div class="outline-text-3" id="text-4-3">
</div>
</li></ul>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Lecture 5: Correlated equilibrium</h2>
<div class="outline-text-2" id="text-5">
</div><ul class="org-ul"><li><a id="sec-5-1" name="sec-5-1"></a>Correlated equilibrium<br  /></li>
<li><a id="sec-5-2" name="sec-5-2"></a>reading: OR 3.3 or MSZ 8<br  /><div class="outline-text-3" id="text-5-2">
</div>
</li></ul>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Lecture 6: Supermodular games</h2>
<div class="outline-text-2" id="text-6">
</div><ul class="org-ul"><li><a id="sec-6-1" name="sec-6-1"></a>Amir paper, Milgrom and Roberts paper<br  /><div class="outline-text-3" id="text-6-1">
</div>
</li></ul>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Lecture 7: Refinements in strategic form games</h2>
<div class="outline-text-2" id="text-7">
</div><ul class="org-ul"><li><a id="sec-7-1" name="sec-7-1"></a>Perfect equilibrium<br  /></li>
<li><a id="sec-7-2" name="sec-7-2"></a>reading: lecture notes by Hans Keiding, (MSZ 7.3.1)<br  /><div class="outline-text-3" id="text-7-2">
</div>
</li></ul>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Lecture 8: Refinements in extensive form games with imperfect information</h2>
<div class="outline-text-2" id="text-8">
</div><ul class="org-ul"><li><a id="sec-8-1" name="sec-8-1"></a>Behavior strategies<br  /></li>
<li><a id="sec-8-2" name="sec-8-2"></a>Perfect equilibrium<br  /><div class="outline-text-3" id="text-8-2">
</div>
</li>
<li><a id="sec-8-3" name="sec-8-3"></a>reading: OR 11.1, 11.4, 11.5, 12.1, 12.5 or MSZ 9.4, 7.3.2<br  /></li></ul>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Lecture 9: Midterm Assignment</h2>
<div class="outline-text-2" id="text-9">
</div><ul class="org-ul"><li><a id="sec-9-1" name="sec-9-1"></a>discussing solutions to midterm assignment<br  /></li></ul>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Lecture 10: Knowledge I</h2>
<div class="outline-text-2" id="text-10">
</div><ul class="org-ul"><li><a id="sec-10-1" name="sec-10-1"></a>Hat game<br  /></li>
<li><a id="sec-10-2" name="sec-10-2"></a>Aumann model<br  /></li>
<li><a id="sec-10-3" name="sec-10-3"></a>reading: OR 5.1-5.2 or MSZ 9.1<br  /><div class="outline-text-3" id="text-10-3">
</div>
</li></ul>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Lecture 11: Knowledge II</h2>
<div class="outline-text-2" id="text-11">
</div><ul class="org-ul"><li><a id="sec-11-1" name="sec-11-1"></a>No agree to disagree<br  /></li>
<li><a id="sec-11-2" name="sec-11-2"></a>(Common) knowledge and solution concepts<br  /></li>
<li><a id="sec-11-3" name="sec-11-3"></a>Electronic mail game<br  /></li>
<li><a id="sec-11-4" name="sec-11-4"></a>reading: OR 5.3-5.5 or MSZ 9.2<br  /><div class="outline-text-3" id="text-11-4">
</div>
</li></ul>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Lecture 12: Global Games</h2>
<div class="outline-text-2" id="text-12">
</div><ul class="org-ul"><li><a id="sec-12-1" name="sec-12-1"></a>Carlson and van Damme (p. 989-993), Morris and Shin paper<br  /><div class="outline-text-3" id="text-12-1">
</div>
</li></ul>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">Lecture 13: Social Choice I</h2>
<div class="outline-text-2" id="text-13">
</div><ul class="org-ul"><li><a id="sec-13-1" name="sec-13-1"></a>Social welfare functions<br  /></li>
<li><a id="sec-13-2" name="sec-13-2"></a>Arrow's impossibility theorem<br  /></li>
<li><a id="sec-13-3" name="sec-13-3"></a>reading: MSZ 21.1<br  /></li></ul>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">Lecture 14: Social Choice II</h2>
<div class="outline-text-2" id="text-14">
</div><ul class="org-ul"><li><a id="sec-14-1" name="sec-14-1"></a>Social choice functions<br  /></li>
<li><a id="sec-14-2" name="sec-14-2"></a>Gibbard-Satterthwaite theorem<br  /></li>
<li><a id="sec-14-3" name="sec-14-3"></a>reading: MSZ 21.2, 21.3<br  /></li></ul>
</div>


<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">Bibliography</h2>
<div class="outline-text-2" id="text-15">
<p>
OR: Osborne and Rubinstein 1994; A course in game theory; MIT Press (available as free ebook on the author's <a href="http://books.osborne.economics.utoronto.ca/">website</a>)
</p>

<p>
MSZ: Maschler, Salon and Zamir 2013; Game theory; Cambridge University Press (KU library <a href="http://dx.doi.org.ep.fjernadgang.kb.dk/10.1017/CBO9780511794216">link</a>)
</p>

<p>
MWG: MasColell, Whinston and Green 1995; Microeconomic theory; Oxford University Press
</p>

<p>
FT: Fudenberg and Tirole 1991; Game theory; MIT Press
</p>

<p>
Aumann 1985: What is game theory trying to accomplish?; Frontiers of Economics; <a href="http://www.ma.huji.ac.il/~raumann/pdf/what%20is%20game%20theory.pdf">link</a>
</p>

<p>
Carlson and van Damme "Global Games and Equilibrium Selection", Econometrica, Vol. 61, No. 5 (Sep., 1993), pp. 989-1018;  <a href="http://www.jstor.org.ep.fjernadgang.kb.dk/stable/2951491">link</a>
</p>

<p>
Morris and Shin “Global Games: Theory and Applications”, Econometric Society Monographs 35, 2003, 56-114 - Cambridge University Press; <a href="https://www.princeton.edu/~smorris/pdfs/paper_36_Global_Games.pdf">link</a>
</p>

<p>
Morris, Stephen, and Hyun Song Shin. "Unique equilibrium in a model of self-fulfilling currency attacks." American Economic Review, Vol. 88, No. 3 (1998): 587-597. <a href="http://www.jstor.org/stable/116850%20">link</a>
</p>

<p>
Amir, Rabah. "Supermodularity and complementarity in economics: an elementary survey", Southern Economic Journal, Vol. 71, No. 3 (2005): 636-660. <a href="http://www.jstor.org/stable/20062066%20">link</a>
</p>

<p>
Milgrom and Roberts “Rationalizability, Learning, and Equilibrium in Games with Strategic Complementarities”, Econometrica, Vol. 58, No. 6. (Nov., 1990), pp. 1255-1277; <a href="http://www.jstor.org.ep.fjernadgang.kb.dk/stable/2938316">link</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Christoph Schottmueller</p>
<p class="date">Created: 2015-08-08 Sat 17:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
